# taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "mveritym/mel"
tap "warrensbox/tap"

# Automate deployment, configuration, and upgrading
  brew "ansible"
# SSL/TLS cryptography library
brew "openssl"
# Official Amazon AWS command-line interface
brew "awscli"
# CloudFlare's PKI toolkit
brew "cfssl"
# Load/unload environment variables based on $PWD
brew "direnv"
# GNU compiler collection
brew "gcc"
# Manage your Google Compute Engine resources
brew "gcutil"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Prevents you from committing sensitive information to a git repo
brew "git-secrets"
# CLI for the Jinja2 templating language
brew "jinja2-cli"
# Lightweight and flexible command-line JSON processor
brew "jq"
# The Kubernetes package manager
brew "kubernetes-helm"
# Terminal-based visual file manager
brew "midnight-commander"
# Python dependency management tool
brew "pipenv"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Autoformat shell script source code
brew "shfmt"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Improve Terraform's plan output
brew "terraform_landscape"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Process YAML documents from the CLI
brew "yq"
# Tracks most-used directories to make cd smarter
brew "z"
# Decode all parts of a kubernetes secret, no more copypasting!
brew "mveritym/mel/kubedecode"
# ci
if OS.mac?
  brew "jenkins-x/jx/jx"
  # Kubernetes command-line interface.
  brew "kubernetes-cli"
  # Tool that can switch between kubectl contexts easily and create aliases
  brew "kubectx"
  # Terraform switcher
  brew "tfswitch"
end